#define JOY_EVENT_NULL 0x00
#define JOY_EVENT_TYPE_CHANGED 0x01
#define JOY_EVENT_LIVE_TYPE_CHANGED 0x02
#define JOY_EVENT_EXIT_DEMO_DISC 0x03
#define JOY_EVENT_SCROLL_UP 0x04
#define JOY_EVENT_SCROLL_DOWN 0x05
#define JOY_EVENT_SCROLL_LEFT 0x06
#define JOY_EVENT_SCROLL_RIGHT 0x07
#define JOY_EVENT_FENG_START 0x1E
#define JOY_EVENT_FENG_BUTTON0 0x1F
#define JOY_EVENT_FENG_BUTTON1 0x20
#define JOY_EVENT_FENG_BUTTON2 0x21
#define JOY_EVENT_FENG_BUTTON3 0x22
#define JOY_EVENT_FENG_LTRIGGER 0x23
#define JOY_EVENT_FENG_RTRIGGER 0x24
#define JOY_EVENT_FENG_SELECT 0x25
#define JOY_EVENT_FENG_SELECT_ALTERNATE 0x26
#define JOY_EVENT_FENG_CANCEL 0x27
#define JOY_EVENT_FENG_CANCEL_ALTERNATE 0x28
#define JOY_EVENT_FENG_HELP 0x29
#define JOY_EVENT_FENG_PAD_UP 0x2A
#define JOY_EVENT_FENG_PAD_DOWN 0x2B
#define JOY_EVENT_FENG_PAD_LEFT 0x2C
#define JOY_EVENT_FENG_PAD_RIGHT 0x2D
#define JOY_EVENT_FENG_PAD_UP_ALTERNATE 0x2E
#define JOY_EVENT_FENG_PAD_DOWN_ALTERNATE 0x2F
#define JOY_EVENT_FENG_PAD_LEFT_ALTERNATE 0x30
#define JOY_EVENT_FENG_PAD_RIGHT_ALTERNATE 0x31
#define JOY_EVENT_FENG_QUIT 0x32
#define JOY_EVENT_FENG_RACEOPTIONS 0x33
#define JOY_EVENT_START 0x08
#define JOY_EVENT_SELECT 0x09
#define JOY_EVENT_MENU_SELECT 0x0A
#define JOY_EVENT_MENU_CANCEL 0x0B
#define JOY_EVENT_MENU_BACK 0x0C
#define JOY_EVENT_MENU_HELP 0x0D
#define JOY_EVENT_MENU_L1 0x0E
#define JOY_EVENT_MENU_L2 0x0F
#define JOY_EVENT_MENU_R1 0x10
#define JOY_EVENT_MENU_R2 0x11
#define JOY_EVENT_MENU_SQUARE 0x12

#define JOY_EVENT_AIM_ROCKET_UD 0xB3
#define JOY_EVENT_AIM_ZOOM 0xB4
#define JOY_EVENT_AUTO_PILOT 0xB5
#define JOY_EVENT_DRAG_RACE_CHANGE_LANE_LEFT 0xB8
#define JOY_EVENT_DRAG_RACE_CHANGE_LANE_RIGHT 0xB9
#define JOY_EVENT_DRAG_RACE_CHANGE_LANE_LEFT_ANALOG 0xBA
#define JOY_EVENT_DRAG_RACE_CHANGE_LANE_RIGHT_ANALOG 0xBB
#define JOY_EVENT_CYCLE_HUD 0xBC
#define JOY_EVENT_PAUSE 0xBD
#define JOY_EVENT_SKIP 0xBE
#define JOY_EVENT_REQUEST_ENGAGE_INFO 0xBF
#define JOY_EVENT_REQUEST_WORLD_MAP 0xC0
#define JOY_EVENT_REQUEST_LEGEND 0xC1
#define JOY_EVENT_REQUEST_MESSAGE_SYSTEM 0xC2
#define JOY_EVENT_CAMERA_EDITOR_HOLD_LEFT 0xD3
#define JOY_EVENT_CAMERA_EDITOR_HOLD_RIGHT 0xD4
#define JOY_EVENT_CAMERA_EDITOR_UP 0xD5
#define JOY_EVENT_CAMERA_EDITOR_DOWN 0xD6
#define JOY_EVENT_CAMERA_EDITOR_LEFT 0xD7
#define JOY_EVENT_CAMERA_EDITOR_RIGHT 0xD8
#define JOY_EVENT_CAMERA_EDITOR_HELP 0xD9
#define JOY_EVENT_CAMERA_EDITOR_HIDE 0xDA
#define JOY_EVENT_CAMERA_EDITOR_SCREENSHOT 0xDB
#define JOY_EVENT_CAMERA_EDITOR_CUT 0xDC
#define JOY_EVENT_CAMERA_EDITOR_COPY 0xDD
#define JOY_EVENT_CAMERA_EDITOR_UNDO 0xDE
#define JOY_EVENT_CAMERA_EDITOR_PLAY_ANIMATION 0xDF
#define JOY_EVENT_CAMERA_EDITOR_PASTE 0xE0
#define JOY_EVENT_CAMERA_EDITOR_INSERT 0xE1
#define JOY_EVENT_CAMERA_EDITOR_SELECT 0xE2
#define JOY_EVENT_CAMERA_EDITOR_CANCEL 0xE3
#define JOY_EVENT_CAMERA_EDITOR_ALT_1 0xE4
#define JOY_EVENT_CAMERA_EDITOR_CLIP_IN 0xE5
#define JOY_EVENT_CAMERA_EDITOR_CLIP_OUT 0xE6
#define JOY_EVENT_CAMERA_EDITOR_ZOOM_IN 0xE7
#define JOY_EVENT_CAMERA_EDITOR_ZOOM_OUT 0xE8
#define JOY_EVENT_CAMERA_EDITOR_APERTURE_INC 0xE9
#define JOY_EVENT_CAMERA_EDITOR_APERTURE_DEC 0xEA
#define JOY_EVENT_CAMERA_EDITOR_LETTERBOX_IN 0xEB
#define JOY_EVENT_CAMERA_EDITOR_LETTERBOX_OUT 0xEC
#define JOY_EVENT_CAMERA_EDITOR_BUBBLE_IN 0xED
#define JOY_EVENT_CAMERA_EDITOR_BUBBLE_OUT 0xEE
#define JOY_EVENT_CAMERA_EDITOR_BUBBLE_UP 0xEF
#define JOY_EVENT_CAMERA_EDITOR_BUBBLE_DOWN 0xF0
#define JOY_EVENT_CAMERA_EDITOR_BUBBLE_TILT 0xF1
#define JOY_EVENT_CAMERA_EDITOR_BUBBLE_SPIN 0xF2
#define JOY_EVENT_CAMERA_EDITOR_BUBBLE_LEFT_RIGHT 0xF3
#define JOY_EVENT_CAMERA_EDITOR_BUBBLE_BACK_FORTH 0xF4
#define JOY_EVENT_CAMERA_EDITOR_SHAKE_MAG 0xF5
#define JOY_EVENT_CAMERA_EDITOR_SHAKE_FRQ 0xF6
#define JOY_EVENT_CAMERA_EDITOR_SHUTTLE_LEFT_RIGHT 0xF7
#define JOY_EVENT_CAMERA_EDITOR_SHUTTLE_SPEED 0xF8

enum MENU_STATE { /*7 members*/
	MENU_STATE_CAREER_MENU = 0x1,
	MENU_STATE_MAIN_MENU = 0x2,
	MENU_STATE_2P_SPLITSCREEN = 0x4,
	MENU_STATE_ONLINE_MAIN_MENU = 0x8,
	MENU_STATE_OPTIONS = 0x10,
	MENU_STATE_CAR_CUSTOMIZE = 0x20,
	MENU_STATE_CUSTOMIZE_FROM_ONLINE_MAIN_MENU = 0x100,
	MENU_STATE_LAN_MAIN_MENU = 0x200,
};

enum INVENTORY_CAR_FLAGS { /*5 members*/
	IS_STOCK_CAR = 0x1,
	IS_TUNED_CAR = 0x2,
	IS_CAREER_CAR = 0x4,
	IS_SPONSOR_CAR = 0x8,
	IS_ONLINE_CAR = 0x10,
};

enum UIELEMENTFLAGS { /*6 members*/
	HIDDEN = 0x1,
	USE_CUSTOM_TEXT = 0x2,
	CLICKABLE = 0x10,
	NEED_UPDATE_0 = 0x400000,
	NEED_UPDATE_1 = 0x1000000,
	NEED_UPDATE_2 = 0x2000000,
};

struct BinSectionHeader { /*2 members, size 8h*/
/*0*/	unsigned int magic;
/*4*/	int size;
};

struct BinSection { /*2 members, size 9h*/
/*0*/	struct BinSectionHeader header;
/**actual data size is determined by struct BinSectionHeader.size*/
/*8*/	char data[1];
};

struct BinSection30203Data { /*4 members, size 32h*/
/*0*/	int field_0;
/*4*/	char _pad4[0x4];
/*8*/	int field_8;
/*C*/	char _padC[0x4];
/*10*/	int field_10;
/*14*/	char _pad14[0x14];
/**length unknown*/
/*28*/	char fngName[10] ;
};

enum MARKER_TYPE { /*7 members*/
/**marks the entrance, ie where the road goes into private property, not the entrance aura itself.
Maybe this is used as the "discover" hitmarker (ie the map icon will show from the first time you hit this marker)?*/
	MARKER_TYPE_BODYSHOP_AREA = 0x4,
	MARKER_TYPE_D = 0xD,
	MARKER_TYPE_E = 0xE,
	MARKER_TYPE_F = 0xF,
	MARKER_TYPE_NEIGHBOURHOOD = 0x11,
	MARKER_TYPE_ENGAGE_TIP = 0x12,
	MARKER_TYPE_MONEY_PICKUP = 0x13,
};

struct DialogInfo {
	char text[768];
	int unused300;
	int unused304;
	int unused308;
	int unused30C;
	int unused310;
	int unused314;
	int unused318;
	int unused31C;
	char *pParentFNG; /*read in 5580EB*/
	char *pMyFNG;
	int numButtons;
	char unused_32C;
	char isHelpDialog;
	char unused_32E;
	char textNeedsSomeWcharConversion; /*set to 0 in 55806D*/
	int something330; /*set to 0 in 558074*/
	int unused334;
};
EXPECT_SIZE(struct DialogInfo, 0x338);
ASSERT_OFFSET(struct DialogInfo, pMyFNG, 0x324);
ASSERT_OFFSET(struct DialogInfo, isHelpDialog, 0x32D);

struct CarModelInfo {
	char brand[0x20];
	char brand2[0x20];
	char geometry_bin[0x20];
	char geometry_lzc[0x20];
	char unk80[0x20];
	char unkA0[0x20];
	char manufacturer[0x40];
	char pad[0x790];
};
EXPECT_SIZE(struct CarModelInfo, 0x890);
ASSERT_OFFSET(struct CarModelInfo, manufacturer, 0xC0);

struct ObjectLink {
	struct ObjectLink *next;
	struct ObjectLink *prev;
};
EXPECT_SIZE(struct ObjectLink, 0x8);

struct U2RECT {
	float left, top, right, bottom;
};

struct vec2 {
	float x, y;
};

struct UIData_Field8 {
	char pad[0xE4];
	struct FNGInfo *topPackage;
};

struct UIData {
	int f0;
	int f4;
	struct UIData_Field8 *field_8;
};

typedef struct FNGObject* (fnginithandler)(struct FNGShowData *msg);

struct FNGData {
	char *name;
	fnginithandler *initializeHandler;
	unsigned int helpTextLanguageString;
	unsigned int helpBarMask;
	int field_10;
	int field_14;
	int field_18;
};
EXPECT_SIZE(struct FNGData, 0x1C);

struct FNGShowData {
	char *fngname;
	struct FNGInfo *fngInfo;
	unsigned int helpTextLanguageString;
	unsigned int helpBarMask;
	int arg2;
};
EXPECT_SIZE(struct FNGShowData, 0x14);

struct FNGInfo {
        int field_0;
        struct FNGInfo *child;
        int field_8;
        char *fngName;
        unsigned int hash;
        int field_14;
        int field_18;
        int controlMask;
        int field_20;
        int field_24;
        int field_28;
        int field_2C;
        int field_30;
        int field_34;
        int field_38;
        int field_3C;
        int field_40;
        int field_44;
        int field_48;
        struct UIElement *rootUIElement;
};

struct SomethingUIImpl { /*21 members, size 54h*/ 
/*0*/	void *vtable;
/*4*/	struct ObjectLink link;
/**set if this instance is from a 30203 binsection, else null*/
/*C*/	struct BinSection30203Data *data30203;
/*10*/	struct BinSection *binsection;
/*14*/	struct FNGObject *fng;
/*18*/	struct FNGInfo *fnginfo;
/*1C*/	short field_1C;
/*1E*/	short field_1E;
/**ptr to the entry in fngdata for the hash of this struct's fngname (which comes from its bindata), initialized in ctor*/
/*20*/	struct FNGData *fngData;
/*24*/	int field_24;
/*28*/	char field_28;
/*29*/	char _pad29[0x3];
/*2C*/	int field_2C;
/*30*/	int field_30;
/*34*/	int field_34;
/*38*/	int field_38;
/*3C*/	int field_3C;
/*40*/	int field_40;
/*44*/	int field_44;
/*48*/	int field_48;
/*4C*/	int field_4C;
/*50*/	int field_50;
};

struct SomethingUI { /*2 members, size Ch*/ 
/*0*/	void *vtable;
/**elements are struct SomethingUIImpl*/
/*4*/	struct ObjectLink link;
};

struct MouseData {
	void /*DInputDevice8*/ *dinputdevice;
	int cursorX; // on 640x480 canvas
	int cursorY; // on 640x480 canvas
	int previousCursorX; // on 640x480 canvas
	int previousCursorY; // on 640x480 canvas
	int deltaCursorX; // on 640x480 canvas
	int deltaCursorY; // on 640x480 canvas
	int mousestate_lZ; // scrollwheel data
	char areMouseButtonsSwapped; // result of GetSystemMetrics(SM_SWAPBUTTON);
	char button0State; // left mouse button
	char button0JustPressed;
	char button0JustReleased;
	char button1State; // right mouse button
	char button1JustPressed;
	char button1JustReleased;
	char button2State; // middle mouse button
	char button2JustPressed;
	char button2JustReleased;
};

struct LanguageTableEntry {
	unsigned int hash;
	char *string;
};

struct LoadedLanguage {
        int numStrings;
        char **ptrStrings;
        struct LanguageTableEntry *ptrTable;
        int field_C;
};

#define SMS_TYPE_END_OF_GAME 1
#define SMS_TYPE_CAREER_START 2
#define SMS_TYPE_INSTRUCTIONS 3
#define SMS_TYPE_OUTRUN_INFO 4
#define SMS_TYPE_OUTRUN_VICTORY 5
#define SMS_TYPE_OUTRUN_DEFEAT 6
#define SMS_TYPE_UNLOCK_9 9
#define SMS_TYPE_UNLOCK_10 10
#define SMS_TYPE_UNLOCK_12 12
#define SMS_TYPE_MAGS_AND_UNIQUES 13
#define SMS_TYPE_DVD_COVER 14
#define SMS_TYPE_ENGAGE_TIP 15

struct SmsData {
	short careerTextLanguageTableOffset;
	char type;
	char mailboxId;
	int field_4;
	int hash;
	int moneyReward;
	unsigned int senderLanguageLabel;
};

struct SmsMessage {
	struct SmsData *data;
	char read;
	char field_5;
	char deleted;
	char movedToCorrectInbox;
	unsigned int bodyFormatLanguageLabel;
	unsigned int subjectAndBodyParameterLanguageLabel;
	unsigned int subjectFormatLanguageLabel;
};

struct SmsMessageList {
	struct SmsMessage messages[256];
	int numMessages;
	int numUnreadMessages;
	int field_1408;
	char field_140C;
	char field_140D;
	char field_140E;
	char field_140F;
	int field_1410;
};

struct WideCharString {
	wchar_t *ptrString;
	int allocatedWcharLength; /*amount of wchars that can fit, excluding zero term*/
};

struct UIPos {
	int field_0;
	int field_4;
	int field_8;
	int field_C;
	int field_10;
	int field_14;
	int field_18;
	float leftOffset;
	float topOffset;
	int field_24;
	int field_28;
	int field_2C;
	int field_30;
	int field_34;
	float field_38;
	float field_3C;
};

struct UIElement_Animation {
	int field_0;
	struct UIElement_Animation *next;
	int field_8;
	int field_C;
	int maybeTimer_;
	int field_14;
	int field_18;
	int field_1C;
	int ptrField_20;
	int field_24;
	int field_28;
	int field_2C;
	unsigned int hash;
};
EXPECT_SIZE(struct UIElement_Animation, 0x34);

#define UIELEMENT_FLAG_HIDDEN 1
#define UIELEMENT_FLAG_USE_CUSTOM_TEXT 2
#define UIELEMENT_FLAG_NEED_UPDATE_0 0x400000
#define UIELEMENT_FLAG_NEED_UPDATE_1 0x1000000
#define UIELEMENT_FLAG_NEED_UPDATE_2 0x2000000

struct UIElement {
	int vtable;
	struct UIElement *nextSibling;
	int field_8;
	int field_C;
	unsigned int hash;
	int field_14;
	int type;
	int someFlags;
	int field_20;
	int field_24;
	int field_28;
	struct UIPos *pos;
	int field_30;
	int field_34;
	int field_38;
	int field_3C;
	int field_40;
	int field_44;
	int field_48;
	struct ObjectLink animationLink_;
	struct UIElement_Animation *currentAnimation_;
	void *feRenderObject;
};
EXPECT_SIZE(struct UIElement, 0x5C);

struct UILabel {
	struct UIElement __parent;
	int field_5C;
	unsigned int textLanguageString;
	struct WideCharString string; /*is used when textLanguageString is invalid or flag 2 is set*/
	int field_6C;
	int field_70;
};
EXPECT_SIZE(struct UILabel, 0x74);
ASSERT_OFFSET(struct UILabel, string, 0x64);

struct UIContainer {
	struct UIElement __parent;
	int field_5C;
	int numChildren;
	struct UIElement *children;
};
EXPECT_SIZE(struct UIContainer, 0x68);
ASSERT_OFFSET(struct UIContainer, children, 0x64);

struct PoolLink {
        struct PoolLink *prev;
        struct PoolLink *next;
};
EXPECT_SIZE(struct PoolLink, 0x8);

struct PoolControl {
        int inited;
        struct PoolLink link;
};
EXPECT_SIZE(struct PoolControl, 0xC);

#define POOL_FLAG_EXTENDABLE 1

struct Pool {
	struct PoolLink __parent;
	struct Pool *nextLinkedPool;
	char* name;
	struct PoolEntry *firstAvailableElement;
	int flagsMaybe;
	int availableElements_;
	int maxAllocatedElements_;
	int field_20;
	int elementAmount;
	int elementSize;
	int elementAmountOverAllLinkedPools;
        /*pool entries come here*/
};
EXPECT_SIZE(struct Pool, 0x30);

struct PoolEntry {
        struct PoolEntry *nextEntry;
        struct PoolEntry *prevEntry_;
};
EXPECT_SIZE(struct PoolEntry, 0x8);

struct NeighbourhoodName { /*2 members, size 8h*/
/*0*/	char *ptrName;
/*4*/	unsigned int hash;
};

struct PathsData { /*17 members, size 4A0h*/ 
/*0*/	int field_0;
/*4*/	int field_4;
/*8*/	int field_8;
/*C*/	int field_C;
/*10*/	int field_10;
/*14*/	float floatField_14;
/*18*/	float floatField_18;
/*1C*/	int field_1C;
/*20*/	char field_20;
/*21*/	char _pad21[0x1];
/*22*/	char field_22;
/*23*/	char _pad23[0x1];
/*24*/	int field_24;
/*28*/	char _pad28[0x40C];
/**number of entries in allMarkers, note that each entry has a dynamic size of markerStructSize*/
/*434*/	int numMarkers;
/**allMarkers is loaded from binsection 3414A data, this field is the "size" field of that binsection

size of allMarkers*/
/*438*/	int allMarkersSize;
/**array of all markers, this is sorted by marker type (first come all markers with type 0, then 1, ..)*/
/*43C*/	struct Marker *allMarkers;
/**each entry points to the marker in array {struct PathsData+43C} that is the first marker of the type indicated by the entry index.
(ie {{struct PathsData+440}[3]} points to the first entry in {struct PathsData+43C} where the type is 3)
that also means accessing element type+1 points to the end of the series of markers of that type (exclusive)
that's also why there are 22 entries, index 21 simply points to the end of type 20 markers (there is no marker type 21)*/
/*440*/	struct Marker *markersOfType_Start[22];
/*498*/	int field_498;
/*49C*/	int field_49C;
};
EXPECT_SIZE(struct PathsData, 0x4A0);

struct Marker { /*19 members, size 51h*/
/*0*/	enum MARKER_TYPE type;
/*4*/	float floatField_4;
/*8*/	float floatField_8;
/*C*/	int field_C;
/*10*/	int field_10;
/*14*/	int field_14;
/*18*/	int field_18;
/*1C*/	int field_1C;
/**x & y minimum of the square that denotes the hitposition*/
/*20*/	struct vec2 squarePositionMin;
/**x & y maximum of the square that denotes the hitposition*/
/*28*/	struct vec2 squarePositionMax;
/**for type neighbourhood: hash of name
for type engage tip: hash of sms name
for money: hash of sound effect to play!?*/
/*30*/	unsigned int hash;
/*34*/	int field_34;
/*38*/	int field_38;
/*3C*/	int field_3C;
/**usually 4-14*/
/*40*/	__int16 radius;
/**seems like there are marker subtypes with different sizes*/
/*42*/	__int16 markerStructSize;
/*44*/	float pos_x;
/*48*/	float pos_y;
/*4C*/	char _pad4C[0x4];
/*50*/	char field_50;
};
EXPECT_SIZE(struct Marker, 0x51);

struct MoneyMarkerConfiguration { /*5 members, size Ch*/
/*0*/	__int16 amount;
/**this determines how availabilityConditionValue is interpreted as available condition:
1: value is the career stage in which it becomes available
2: value is a hash of something that should be collected (race finished?)
other: no special availability condition*/
/*2*/	char availabilityCondition;
/**has to be unique, is used to check if it was collected already (stored in save game)*/
/*3*/	char moneyMarkerId;
/*4*/	unsigned int availabilityConditionValue;
/*8*/	unsigned int hash;
};
EXPECT_SIZE(struct MoneyMarkerConfiguration, 0xC);

struct FNGObject {
	int *vtable;
	char *fngName;
	char field_8;
	char field_9;
	char field_A;
	char field_B;
	int field_C;
	char field_10;
	char field_11;
	char field_12;
	char field_13;
	struct FNGShowData fngShowData;
	int fngdata_field8;
	char field_2C;
	char field_2D;
	char field_2E;
	char field_2F;
	int field_30;
	struct UIElement *uiElement_34;
	struct UIElement *uiElement_38;
	struct UIElement *uiElement_3C;
	float floatField_40;
	float floatField_44;
	int field_48;
};
EXPECT_SIZE(struct FNGObject, 0x4C);

struct CareerCarLotFNGObject_50 { /*16 members, size 930h*/ 
/**just a dtor*/
/*0*/	int vtable ;
/*4*/	int field_4;
/*8*/	int field_8;
/*C*/	int field_C;
/*10*/	struct ObjectLink link;
/*18*/	int field_18;
/*1C*/	int field_1C;
/*20*/	char field_20[0x8F0];
/**1 or 2*/
/*910*/	unsigned int playerId;
/**just a guess*/
/*914*/	char needApplyTuningToCarInstance;
/*915*/	char _pad915[0x3];
/*918*/	struct Car *car;
/*91C*/	int field_91C;
/**gets its value from struct InventoryCar.slotHash*/
/*920*/	unsigned int slotHash ;
/*924*/	int field_924;
/*928*/	int field_928;
/*92C*/	char _pad92C[0x3];
/*92F*/	char __end ;
};
EXPECT_SIZE(struct CareerCarLotFNGObject_50, 0x930);

struct CarSelectFNGObject { /*28 members, size 1B8h*/ 
/*0*/	struct FNGObject __parent;
/*4C*/	char field_4C;
/*4D*/	char field_4D;
/*4E*/	char field_4E;
/*4F*/	char _pad4F[0x1];
/**entries are struct CareerCarLotFNGObject_50 (link offset 10h)*/
/*50*/	struct ObjectLink selectableCars;
/*58*/	struct CareerCarLotFNGObject_50 *currentSelectedCar;
/**0/1*/
/*5C*/	int browsingPlayerIndex;
/*60*/	int numSelectableCars;
/**assumption; please confirm
0 is sentinel node*/
/*64*/	int currentIndexInSelectableCars;
/*68*/	int field_68;
/*6C*/  char scrollingThing[0x58];
/*C4*/	int field_C4;
/*C8*/	struct UIElementType1 *manufacturerLogoUIElement;
/*CC*/	struct UIElementType1 *carBadgeUIElement;
/*D0*/	struct UIElement *prevCategoryButton;
/*D4*/	struct UIElement *nextCategoryButton;
/*D8*/	char accelerationIndicator[0x44];
/*11C*/ char topSpeedIndicator[0x44];
/*160*/	char handlingIndicator[0x44];
/*1A4*/	char field_1A4;
/*1A5*/	char field_1A5;
/*1A6*/	char field_1A6;
/*1A7*/	char field_1A7;
/**initialized to profileData.player1.d4.currentCarSelectionSlotHash?*/
/*1A8*/	unsigned int slotHash;
/*1AC*/	int field_1AC;
/*1B0*/	int field_1B0;
/*1B4*/	char field_1B4;
/*1B5*/	char _pad1B5[0x2];
/*1B7*/	char __end ;
};
EXPECT_SIZE(struct CarSelectFNGObject, 0x1B8);

struct PCHelpBarFNGObject {
	struct FNGObject __parent;
	struct ObjectLink buttonsLink;
	int field_54;
	char *buttonOwnerFngName;
	char *oldButtonOwnerFngName;
	int field_60;
	unsigned int currentButtonMask;
	int someTimingField;
	char shouldShow;
	char field_6D;
	char field_6E;
	char field_6F;
};
EXPECT_SIZE(struct PCHelpBarFNGObject, 0x70);

struct ScrollingThing { /*25 members, size 58h*/ 
/*0*/	char field_0;
/*1*/	char field_1;
/*2*/	char field_2;
/*3*/	char field_3;
/*4*/	int field_4;
/*8*/	int field_8;
/*C*/	int field_C;
/*10*/	int field_10;
/*14*/	int field_14;
/*18*/	int field_18;
/*1C*/	int floatField_1C;
/*20*/	int floatField_20;
/*24*/	int field_24;
/*28*/	int ptrField_28 ;
/*2C*/	int floatField_2C;
/*30*/	int floatField_30;
/*34*/	int field_34;
/*38*/	int field_38;
/*3C*/	int field_3C;
/**%s_Backing*/
/*40*/	struct UIElementType1 *uiElementBacking;
/**%s_Handle*/
/*44*/	struct UIElementType1 *uiElementHandle;
/**%s_Arrow_1*/
/*48*/	struct UIElementType1 *uiElementArrow1;
/**%s_Arrow_2*/
/*4C*/	struct UIElementType1 *uiElementArrow2;
/**%s_Backing_End_1*/
/*50*/	struct UIElementType1 *uiElementBackingEnd1;
/**%s_Backing_End_2*/
/*54*/	struct UIElementType1 *uiElementBackingEnd2;
};

struct SubScrollingThing { /*25 members, size A9h*/ 
/**probably {795CB4} ||| ref*/
/*0*/	void *vtable;
/*4*/	int field_4;
/**probably ObjectLink, it's a struct with two members at least*/
/*8*/	struct ObjectLink link1;
/**probably ObjectLink, it's a struct with two members at least*/
/*10*/	struct ObjectLink link2;
/*18*/	int field_18;
/*1C*/	int field_1C;
/*20*/	int field_20;
/*24*/	int field_24;
/*28*/	int field_28;
/*2C*/	int field_2C;
/*30*/	int uielement ;
/*34*/	struct ScrollingThing scrollingThing;
/**stores {struct SubScrollingThing+30} UI element coordinate x ||| ref*/
/*8C*/	float floatField_8C;
/**stores {struct SubScrollingThing+30} UI element coordinate y ||| ref*/
/*90*/	float floatField_90;
/*94*/	float floatField_94;
/*98*/	float floatField_98;
/*9C*/	char field_9C;
/*9D*/	char field_9D;
/*9E*/	char field_9E;
/*9F*/	char field_9F;
/*A0*/	char field_A0;
/*A1*/	char _padA1[0x3];
/*A4*/	int field_A4;
/*A8*/	char field_A8;
};

struct SMSMailboxFNGObject { /*8 members, size 1B8h*/ 
/*0*/	struct FNGObject __parent;
/*4C*/	int someTimingValue ;
/*50*/	struct SubScrollingThing subScrollingThing1;
/*F9*/	char _padF9[0x3];
/*FC*/	struct SubScrollingThing subScrollingThing2;
/*1A5*/	char _pad1A5[0x3];
/*1A8*/	int field_1A8;
/*1AC*/	char field_1AC;
/*1AD*/	char _pad1AD[0x3];
/**ui element "UP_ARROW"*/
/*1B0*/	struct UIElement* uiElementUpArrow ;
/**ui element "DOWN_ARROW"*/
/*1B4*/	struct UIElement* uiElementDownArrow ;
};

struct MailBoxRelated1 { /*11 members, size 34h*/
/**seems like a destructor + nullsub*/
/*0*/	int vtable ;
/**links own types*/
/*4*/	struct ObjectLink link1;
/**links {struct MailBoxRelated2} ||| ref*/
/*C*/	struct ObjectLink link2;
/**ui element "HIGH_LIGHT_%d"*/
/*14*/	struct UIElement *uielement;
/*18*/	struct U2RECT elementRect;
/*28*/	char field_28;
/*29*/	char _pad29[0x3];
/*2C*/	char *animationString1;
/*30*/	char *animationString2;
};

struct MailBoxRelated2 { /*2 members, size 10h*/
/**single dtor func*/
/*0*/	int vtable ;
/*4*/	char _pad4[0x8];
/**element with name "MESSAGE_TEXT_%d"*/
/*C*/	int uielement ;
};

struct CarPreset { /*4 members, size 338h*/
/**sentinel node is carPresets*/
/*0*/	struct ObjectLink link;
/**like struct Car.name0*/
/*8*/	char modelName[32];
/**DDAY_PLAYER_CAR, DEMO_AI_300GT_BLUE, sponsor cars, ...*/
/*28*/	char name[32];
/*48*/	char _pad48[0x2EF];
/*337*/	char __end ;
};

struct Player24_60 { /*19 members, size 28h*/
/*0*/	char field_0;
/*1*/	char field_1;
/*2*/	char field_2;
/*3*/	char field_3;
/*4*/	char field_4;
/*5*/	char field_5;
/*6*/	char field_6;
/*7*/	char _pad7[0x1];
/*8*/	int field_8;
/*C*/	char field_C;
/*D*/	char _padD[0x3];
/**initialized to 3*/
/*10*/	int field_10;
/*14*/	char field_14;
/*15*/	char field_15;
/*16*/	char field_16;
/*17*/	char field_17;
/*18*/	char field_18;
/*19*/	char field_19;
/*1A*/	char _pad1A[0x2];
/**initialized to 1.O*/
/*1C*/	float floatField_1C;
/**initialized to 12.5*/
/*20*/	float floatField_20;
/**initialized to 1.0*/
/*24*/	float floatField_24;
};
EXPECT_SIZE(struct Player24_60, 0x28);

struct Player24 { /*28 members, size B0h*/ 
/*0*/	int field_0;
/**initialized to .5*/
/*4*/	float floatField_4;
/*8*/	int field_8;
/*C*/	int field_C;
/*10*/	char field_10;
/*11*/	char _pad11[0x3];
/*14*/	char field_14;
/*15*/	char field_15;
/**initialized to 1 if _currentLoadedLanguage is not 0*/
/*16*/	char useMetricSystem ;
/*17*/	char field_17;
/*18*/	char field_18;
/*19*/	char _pad19[0x3];
/**initialized to 127.5*/
/*1C*/	float floatField_1C;
/**initialized to 127.5*/
/*20*/	float floatField_20;
/**initialized to 1.0*/
/*24*/	float floatField_24;
/**initialized to 1.0*/
/*28*/	float floatField_28;
/**initialized to 0.7*/
/*2C*/	float floatField_2C;
/**initialized to 1.0*/
/*30*/	float floatField_30;
/**initialized to 1.0*/
/*34*/	float floatField_34;
/**initialized to 1.0*/
/*38*/	float floatField_38;
/**initialized to 1.0*/
/*3C*/	float floatField_3C;
/**initialized to 1.0*/
/*40*/	float floatField_40;
/*44*/	int field_44;
/*48*/	int field_48;
/*4C*/	int field_4C;
/*50*/	int field_50;
/*54*/	int field_54;
/*58*/	int field_58;
/*5C*/	int field_5C;
/*60*/	struct Player24_60 field_60[2];
};
EXPECT_SIZE(struct Player24, 0xB0);

struct PlayerD4_10 { /*14 members, size 14h*/
/*0*/	char field_0;
/*1*/	char field_1;
/*2*/	char field_2;
/*3*/	char field_3;
/*4*/	char field_4;
/*5*/	char field_5;
/*6*/	char field_6;
/*7*/	char field_7;
/*8*/	short field_8;
/*A*/	short field_A;
/*C*/	int field_C;
/*10*/	char field_10;
/*11*/	char field_11;
/*12*/	char _pad12[0x1];
/*13*/	char __end ;
};
EXPECT_SIZE(struct PlayerD4_10, 0x14);

struct PlayerD4_100_1C { /*6 members, size Ch*/
/*0*/	short field_0;
/*2*/	short field_2;
/*4*/	int field_4;
/*8*/	char field_8;
/*9*/	char field_9;
/*A*/	char _padA[0x1];
/*B*/	char __end ;
};
EXPECT_SIZE(struct PlayerD4_100_1C, 0xC);

struct PlayerD4_100 { /*15 members, size 7Ch*/ 
/*0*/	char field_0;
/*1*/	char field_1;
/*2*/	char field_2;
/*3*/	char field_3;
/*4*/	char field_4;
/*5*/	char field_5;
/*6*/	char _pad6[0x2];
/*8*/	int field_8;
/*C*/	int field_C;
/*10*/	int field_10;
/*14*/	char field_14;
/*15*/	char field_15;
/*16*/	char _pad16[0x2];
/*18*/	char field_18;
/*19*/	char field_19;
/*1A*/	char field_1A;
/*1B*/	char _pad1B[0x1];
/*1C*/	struct PlayerD4_100_1C field_1C[8];
};
EXPECT_SIZE(struct PlayerD4_100, 0x7C);

struct PlayerD4 { /*5 members, size 17Ch*/ 
/*0*/	int field_0;
/**see 515985

usually a stock car, often STOCK_RX8. some kind of "default car to pick"*/
/*4*/	unsigned int currentCarSelectionSlotHash[2];
/*C*/	enum INVENTORY_CAR_FLAGS currentCarSelectionCategory;
/*10*/	struct PlayerD4_10 field_10[12];
/*100*/	struct PlayerD4_100 field_100;
};
EXPECT_SIZE(struct PlayerD4, 0x17C);

struct TraxConfig { /*3 members, size 8h*/
/**index in traxEntries*/
/*0*/	int traxIndex;
/**0x0 = off, 0x1 = menus, 0x2 = race, 0x3 = all*/
/*4*/	char playWhen;
/*5*/	char _pad5[0x2];
/*7*/	char __end ;
};
EXPECT_SIZE(struct TraxConfig, 0x8);

struct InventoryCar$vtable { /*4 members, size 10h*/
/*0*/	void *dtor;
/**index in ptrCarData. stock: StockCar::GetCarIndex sponsor: SponsorCar::GetCarIndex else: TunedCar::GetCarIndex*/
/*4*/	int (*procGetCarIndex)(struct InventoryCar *this);
/**stock: StockCar::GetCarNameHash sponsor: SponsorCar::GetCarNameHash else: TunedCar::GetCarNameHash*/
/*8*/	unsigned int (*procGetCarNameHash)(struct InventoryCar *this);
/**stock: StockCar::ApplyTuningToInstance sponsor: SponsorCar::ApplyTuningToInstance else: TunedCar::ApplyTuningToInstance
last arg is only used for TunedCar instances*/
/*C*/	void (*procApplyTuningToInstance)(struct InventoryCar *this, int playerIndex, struct MenuCarInstance *menuCarInstance, int);
};
EXPECT_SIZE(struct InventoryCar$vtable, 0x10);

struct InventoryCar { /*6 members, size 18h*/ 
/**not only a destructor!*/
/*0*/	struct InventoryCar$vtable *vtable;
/*4*/	int field_4;
/**STOCK_PEUGEOT when stock,
0 when unused tuned, TUNED_CAR_%d when used tuned,
CAREER_SLOT_%d when career,
SPONSOR_SNOOP_DOGG when sponsor
sometimes this is also just hash of the car name? I wanna cry*/
/*8*/	int slotHash ;
/*C*/	int floatField_C;
/**sponsorcar: 1 after hash is assigned, career: inited to 1 | slotHasCar or something?, tunedcar: 1 after car is assigned?*/
/*10*/	int field_10;
/*14*/	enum INVENTORY_CAR_FLAGS flags14;
};
EXPECT_SIZE(struct InventoryCar, 0x18);

struct StockCar { /*2 members, size 1Ch*/ 
/*0*/	struct InventoryCar __parent;
/**index in ptrCarData*/
/*18*/	int indexInCarData ;
};
EXPECT_SIZE(struct StockCar, 0x1C);

struct MenuCarInstance_10_2E0 { /*3 members, size 94h*/ 
/*0*/	char field_0[40];
/*28*/	char field_28[40];
/*50*/	char field_50[68];
};
EXPECT_SIZE(struct MenuCarInstance_10_2E0, 0x94);

struct TunedCar360_17 { /*3 members, size 9h*/
/*0*/	int field_0;
/*4*/	int field_4;
/*8*/	char field_8;
};
EXPECT_SIZE(struct TunedCar360_17, 0x9);

struct TunedCar360_20 { /*3 members, size 9h*/
/*0*/	int field_0;
/*4*/	int field_4;
/*8*/	char field_8;
};
EXPECT_SIZE(struct TunedCar360_20, 0x9);

struct TunedCar360 { /*9 members, size 29h*/ 
/*0*/	int field_0;
/*4*/	int field_4;
/*8*/	int field_8;
/*C*/	int field_C;
/*10*/	int field_10;
/*14*/	short field_14;
/*16*/	char field_16;
/*17*/	struct TunedCar360_17 field_17;
/*20*/	struct TunedCar360_20 field_20;
};
EXPECT_SIZE(struct TunedCar360, 0x29);

struct TunedCar18 { /*6 members, size 418h*/ 
/*0*/	int field_0;
/*4*/	char _pad4[0x4];
/**cs hash of struct Car.name0*/
/*8*/	unsigned int carNameHash;
/*C*/	char field_C[680];
/**copied from struct MenuCarInstance at TunedCar18::503950*/
/*2B4*/	struct MenuCarInstance_10_2E0 field_2B4;
/*348*/	struct TunedCar360 field_348[5];
/*415*/	char _pad415[0x2];
/**probably just padding*/
/*417*/	char __end ;
};
EXPECT_SIZE(struct TunedCar18, 0x418);

struct TunedCar { /*3 members, size 434h*/ 
/*0*/	struct InventoryCar __parent;
/*18*/	struct TunedCar18 field_18;
/*430*/	int field_430;
};
EXPECT_SIZE(struct TunedCar, 0x434);

struct OnlineCareerCar { /*1 members, size 434h*/ 
/*0*/	struct TunedCar __parent;
};
EXPECT_SIZE(struct OnlineCareerCar, 0x434);

struct CareerCar434_15C { /*4 members, size 10h*/
/*0*/	int field_0;
/*4*/	int field_4;
/*8*/	int field_8;
/*C*/	int field_C;
};
EXPECT_SIZE(struct CareerCar434_15C, 0x10);

struct CareerCar434_26C { /*4 members, size 10h*/
/*0*/	int field_0;
/*4*/	int field_4;
/*8*/	int field_8;
/*C*/	int field_C;
};
EXPECT_SIZE(struct CareerCar434_26C, 0x10);

struct CareerCar434_27C { /*4 members, size 10h*/
/*0*/	int field_0;
/*4*/	int field_4;
/*8*/	int field_8;
/*C*/	int field_C;
};
EXPECT_SIZE(struct CareerCar434_27C, 0x10);

struct CareerCar434_28C { /*2 members, size 8h*/
/*0*/	int field_0;
/*4*/	int field_4;
};
EXPECT_SIZE(struct CareerCar434_28C, 0x8);

struct CareerCar434_294 { /*2 members, size 8h*/
/*0*/	int field_0;
/*4*/	int field_4;
};
EXPECT_SIZE(struct CareerCar434_294, 0x8);

struct CareerCar434_29C { /*4 members, size 10h*/
/*0*/	int field_0;
/*4*/	int field_4;
/*8*/	int field_8;
/*C*/	int field_C;
};
EXPECT_SIZE(struct CareerCar434_29C, 0x10);

struct CareerCar434 { /*10 members, size 3C0h*/ 
/**87 entries see 503E8B*/
/*0*/	char field_0[348];
/*15C*/	struct CareerCar434_15C field_15C;
/**64 entries see 503E9A*/
/*16C*/	char field_16C[256];
/*26C*/	struct CareerCar434_26C field_26C;
/*27C*/	struct CareerCar434_27C field_27C;
/*28C*/	struct CareerCar434_28C field_28C;
/*294*/	struct CareerCar434_294 field_294;
/*29C*/	struct CareerCar434_29C field_29C;
/**68 entries see 503EDF*/
/*2AC*/	char field_2AC[272];
/*3BC*/	int moneySpentOnCar ;
};
EXPECT_SIZE(struct CareerCar434, 0x3C0);

struct CareerCar { /*5 members, size 7F8h*/ 
/*0*/	struct OnlineCareerCar __parent;
/*434*/	struct CareerCar434 field_434;
/**all slots except first are locked and sequentially unlocked when signing sponsors, see Career::SignSponsor and Career::UnlockNextLockedCarSlot*/
/*7F4*/	char isLocked ;
/*7F5*/	char hasCarBought ;
/*7F6*/	char _pad7F6[0x1];
/*7F7*/	char __end ;
};
EXPECT_SIZE(struct CareerCar, 0x7F8);

struct OnlineCar { /*2 members, size 438h*/
/*0*/	struct OnlineCareerCar __parent;
/**0 circuit, 1 sprint, 2 drag, 3 drift, 4 url, 5-9 ?, 10 street cross*/
/*434*/	int onlineCarType ;
};
EXPECT_SIZE(struct OnlineCar, 0x438);

struct SponsorCar { /*2 members, size 1Ch*/ 
/*0*/	struct InventoryCar __parent;
/**set to hash of SNOOP_DOGG etc, matches name*/
/*18*/	unsigned int carPresetHash;
};
EXPECT_SIZE(struct SponsorCar, 0x1C);

struct CarCollection { /*9 members, size 9BD8h*/ 
/*0*/	struct StockCar stockCars[48];
/*540*/	int numStockCars;
/*544*/	struct TunedCar tunedCars[20];
/*5954*/struct CareerCar careerCars[5];
/**always 5*/
/*812C*/int numCareerCarSlots;
/*8130*/struct OnlineCar onlineCars[6];
/**always 6*/
/*9A80*/int numOnlineCarSlots;
/*9A84*/struct SponsorCar sponsorCars[12];
/*9BD4*/int numSponsorCars;
};
EXPECT_SIZE(struct CarCollection, 0x9BD8);

struct CarCollectionWithPointers { /*6 members, size 9D44h*/ 
/*0*/	struct CarCollection __parent;
/**initialized to &this->__parent.stockCars + i*/
/*9BD8*/struct StockCar *ptrStockCars[48];
/**initialized to &this->__parent.tunedCars + i*/
/*9C98*/struct TunedCar *ptrTunedCars[20];
/**initialized to &this->__parent.careerCars + i*/
/*9CE8*/struct CareerCar *ptrCareerCars[5];
/**initialized to &this->__parent.SponsorCars + i*/
/*9CFC*/struct SponsorCar *ptrSponsorCars[12];
/**initialized to &this->__parent.onlineCars + i*/
/*9D2C*/struct OnlineCar *ptrOnlineCars[6];
};
EXPECT_SIZE(struct CarCollectionWithPointers, 0x9D44);

struct Player { /*14 members, size AB4Ch*/ 
/*0*/	char name[32];
/*20*/	char field_20;
/*21*/	char _pad21[0x3];
/*24*/	struct Player24 p24;
/*D4*/	struct PlayerD4 d4;
/*250*/	int field_250;
/*254*/	int field_254;
/*258*/	char field_258[128];
/*2D8*/	struct TraxConfig traxConfig[27];
/*3B0*/	struct CarCollectionWithPointers carCollection;
/*A0F4*/int field_A0F4;
/*A0F8*/char field_A0F8;
/*A0F9*/char field_A0F9;
/*A0FA*/char field_A0FA;
/*A0FB*/char _padA0FB[0x1];
/*A0FC*/char field_A0FC[2640];
};
EXPECT_SIZE(struct Player, 0xAB4C);

struct ProfileData { /*84 members, size 29DD8h*/ 
/*0*/	int field_0;
/*4*/	char field_4;
/*5*/	char field_5;
/*6*/	char _pad6[0x2];
/*8*/	int field_8;
/*C*/	int field_C;
/*10*/	struct Player players[2];
/*156A8*/enum MENU_STATE menuState;
/*156AC*/char _pad156AC[0x4];
/*156B0*/char field_156B0[0xBC];
/*1576C*/char _pad1576C[0x14];
/*15780*/int field_15780;
/*15784*/int field_15784;
/*15788*/int field_15788;
/*1578C*/int field_1578C;
/*15790*/int field_15790;
/*15794*/char field_15794;
/*15795*/char _pad15795[0xFF];
/*15894*/int field_15894;
/*15898*/char _pad15898[0xFC];
/*15994*/int field_15994;
/*15998*/int field_15998;
/*1599C*/char field_1599C[0xCF4];
/*16690*/char field_16690;
/*16691*/char _pad16691[0x10];
/*166A1*/char field_166A1;
/*166A2*/char _pad166A2[0x10];
/*166B2*/char field_166B2;
/*166B3*/char _pad166B3[0x10];
/*166C3*/char field_166C3;
/*166C4*/char _pad166C4[0x32];
/*166F6*/char field_166F6;
/*166F7*/char _pad166F7[0x65];
/*1675C*/char field_1675C;
/*1675D*/char field_1675D;
/*1675E*/char _pad1675E[0x2];
/*16760*/int field_16760;
/*16764*/int field_16764;
/*16768*/int field_16768;
/*1676C*/char field_1676C;
/*1676D*/char _pad1676D[0x3];
/*16770*/int field_16770;
/*16774*/char _pad16774[0x4];
/*16778*/void *memForWritingSaveData;
/*1677C*/struct CarCollection carCollection;
/*20354*/char _pad20354[0x4];
/**0 or 1*/
/*20358*/int currentPlayerIndex;
};
EXPECT_SIZE(struct ProfileData, 0x2035C);

struct CareerShop { /*7 members, size A0h*/
/*0*/	char _pad0[0x38];
/*38*/	unsigned int hash;
/*3C*/	unsigned int markerHash;
/*40*/	char _pad40[0x11];
/*51*/	char isHiddenShop;
/*52*/	char _pad52[0x22];
/*74*/	unsigned int field_74;
/*78*/	char _pad78[0x24];
/*9C*/	char field_9C;
/*9D*/	char stageIndex;
/*9E*/	char _pad9E[0x1];
/*9F*/	char __end ;
};
EXPECT_SIZE(struct CareerShop, 0xA0);
